Tekla Open API Reference for Tekla Structures 2025
PourObject.PourAttributes Class
 The PourAttributes class is the attributes class for the pour.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.PourObject.PourAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class PourAttributes
	Inherits AttributesBase
The PourObject.PourAttributes type exposes the following members.
Constructors
Name | Description
PourObject.PourAttributes()
 Creates a new default pour attributes instance that loads standard attributes.
PourObject.PourAttributes(String)
 Creates a new pour attributes instance that loads the specified attributes.
Top
Properties
Name | Description
DrawChamfers
 True if chamfers are drawn.
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
FaceHatch
 The hatch type of the face hatch.
HiddenLines
 The line type of hidden lines.
OwnHiddenLines
 The line type of own hidden lines.
SectionFaceHatch
 The hatch type of the section face hatch.
SectionLines
 The line type of section lines.
VisibleLines
 The line type of visible lines.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace